#include <iostream>
#include <string>
#include <Windows.h>
using namespace std;

float us;//курс долара

struct article//структура товару
{
	string describe;//опис
	float price_ua;//ціна в гривнях
	float price_us;//ціна в доларах
	int amount;//кількість на складі
	string type;//тип
	string mark;//марка
};

void enter_data(article *arr,int size)//функція для введення даних
{
	for (int i = 0; i < size; ++i)
	{
		cout << "\t\tЗапис №" << i + 1 << endl;
		cout << "Тип товару:";
		cin >> arr[i].type;//вводимо дані для кжного едемента в масиві
		cout << "Марка товару:";
		cin >> arr[i].mark;
		cout << "Кількість на складі:";
		cin >> arr[i].amount;
		cout << "Опис(характеристика):";
		cin >> arr[i].describe;
		cout << "Ціна в у.о.:";
		cin >> arr[i].price_us;
		arr[i].price_ua = arr[i].price_us * us;
	}
}

void show_info(article*arr, int size)//функція для виведення інформації
{
	//виводимо шапку
	cout << "---------------------------------------------------------------------------------------------------------------------------------" << endl;
	cout << "|\tТип товару\t|\tМарка товару\t|\tКількість на складі\t|\tЦіна в у.о.\t|\tЦіна в гривнях\t|" << endl;
	cout << "---------------------------------------------------------------------------------------------------------------------------------" << endl;
	for (int i = 0; i < size; ++i)//та кожен елемент бази даних
	{
		cout << "|\t" << arr[i].type << "\t\t";
		cout << "|\t" << arr[i].mark << "\t\t";
		cout << "|\t\t" << arr[i].amount << "\t\t";
		cout << "|\t" << arr[i].price_us << "\t\t";
		cout << "|\t\t" << arr[i].price_ua << "\t\t|" << endl;
		cout << "Опис:\n" << arr[i].describe;
		cout << endl;
		cout << "---------------------------------------------------------------------------------------------------------------------------------" << endl;
	}
}

article* del_note(article* arr, int &size)//видаленян елементу з масиву
{
	article a;//тимчасова змінна 
	cout << "Введіть дані про товар, який потрібно видалити:" << endl;
	cout << "Тип товару:";
	cin >> a.type;//введення інформації, про товар який слід видалити з маисву
	cout << "Марка товару:";
	cin >> a.mark;
	int n = 0;//кількість таких записів у масиві
	for (int i = 0; i < size; ++i)
		if (a.type == arr[i].type && a.mark == arr[i].mark)//знаходимо кількість записів, які слід видалити
			++n;
	if (n == 0)//якщо таких записів не знайдено
	{
		cout << "Товар не знайдено" << endl;//виводимо відповідне повідомлення
		return arr;//і повертаємо масив без змін
	}
	article* new_ = new article[size - n];//якщо ж є такі записи, то формуємо
	for (int i = 0,j=0; i < size; ++i)
		if (a.type != arr[i].type && a.mark != arr[i].mark)//тимчасовий масив для збереження даних яких не потрібно видаляти
		{
			new_[j] = arr[i];
			++j;
		}

	size -= n;
	arr = new article[size];//змінюємо розмір головного масиву
	for (int i = 0; i < size; ++i)
		arr[i] = new_[i];//та присвоюємо для нього записи, які не потрібно було видаляти
	delete[]new_;//звільнення пам'яті з-під тимчасового масиву
	cout << "Запис видалено" << endl;
	return arr;//повернення перетвореного масиву
}

void sort_by_type(article* arr, int size)//сортування за типом
{
	for (int i = 1; i < size; i++)//сортуємо за алфавітом від а до я методом бульбашки
	{
		for (int j = 0; j < size - i; j++)
		{
			if (arr[j].type > arr[j + 1].type)
				swap(arr[j], arr[j + 1]);
		}
	}
}

void sort_by_price(article* arr, int size)//сортування за ціною
{
	for (int i = 1; i < size; i++)
	{
		for (int j = 0; j < size - i; j++)//сортуємо в порядку спадання методом бульбашки
		{
			if (arr[j].price_ua < arr[j+ 1].price_ua)
				swap(arr[j], arr[j + 1]);
		}
	}
}

void find_discribe(article* arr, int size, string mark)//пошук опису комп'ютера за заданою маркою
{
	for (int i = 0; i < size; ++i)//проходимося по усіх записах
	{
		if (arr[i].mark == mark&& arr[i].type=="комп'ютер")//якщо знайшли запис про комп'ютер і його марка співпадає із заданою
		{
			cout << "Характеристика:" << endl;
			cout << arr[i].describe << endl;//то виводимо характеристику
			return;//і закінчуємо роботу
		}
	}
	cout << "Даних не знайдено" << endl;
}

void find_printers(article* arr, int size, int price)//пошук принтерів, ціна яких не перевищує заданої ціни
{
	//виводимо шапку для таблиці
	cout << "-----------------------------------------------------------------------------------------------------" << endl;
	cout << "|\tМарка товару\t|\tКількість на складі\t|\tЦіна в у.о.\t|\tЦіна в гривнях\t|" << endl;
	cout << "-----------------------------------------------------------------------------------------------------" << endl;
	int n = 0;//кількість потрібних записів
	for (int i = 0; i < size; ++i)//проходимося по усіх записах
	{
		if (arr[i].price_ua <= price && arr[i].type == "принтер")//якщо натрапили на принтер і його ціна не перевищує заданої
		{
			++n;
			cout << "|\t" << arr[i].mark << "\t\t";//то виводимо інформацію про принтер
			cout << "|\t\t" << arr[i].amount << "\t\t";
			cout << "|\t" << arr[i].price_us << "\t\t";
			cout << "|\t\t" << arr[i].price_ua << "\t\t|" << endl;
			cout << "Опис:\n" << arr[i].describe;
			cout << endl;
			cout << "----------------------------------------------------------------------------------------------------" << endl;
		}
	}
	if(n==0)//якщо таких записів немає, то виводимо відповідне повідомлення
		cout << "Даних не знайдено" << endl;
}

void find_5count(article* arr, int size)//пошук товарів, яких залишилося менше 5 на складі
{
	//виводимо шапку
	cout << "---------------------------------------------------------------------------------------------------------------------------------" << endl;
	cout << "|\tТип товару\t|\tМарка товару\t|\tКількість на складі\t|\tЦіна в у.о.\t|\tЦіна в гривнях\t|" << endl;
	cout << "---------------------------------------------------------------------------------------------------------------------------------" << endl;
	int n = 0;//кілкість потрібних записів
	for (int i = 0; i < size; ++i)//проходимося по всіх записах
	{
		if (arr[i].amount <5)//якщо кількісьтть товару на складі менше 5, то виводимо інформацію про товар
		{
			++n;
			cout << "|\t" << arr[i].type << "\t\t";
			cout << "|\t" << arr[i].mark << "\t\t";
			cout << "|\t\t" << arr[i].amount << "\t\t";
			cout << "|\t" << arr[i].price_us << "\t\t";
			cout << "|\t\t" << arr[i].price_ua << "\t\t|" << endl;
			cout << "Опис:\n" << arr[i].describe;
			cout << endl;
			cout << "---------------------------------------------------------------------------------------------------------------------------------" << endl;
		}
	}
	if (n == 0)//якщо таких записів не знайдено, то виводимо відповідне повідомлення
		cout << "Даних не знайдено" << endl;
}

void corect_price(article* arr, int size)//коректування ціни
{
	for (int i = 0; i < size; ++i)//проходимося по усіх записах
		arr[i].price_ua = us * arr[i].price_us;//та перераховуємо ціну у гривнях
}

void print_information_by_types(article*arr, int size)//вивід інформації за типами
{
	int n = 0;//кількість різних типів товару в базі баних
	string* a = new string[size];//масив зусіма типами товарів
	for (int i = 0; i < size; ++i)//заповнюємо масив з типами товарів
		a[i] = arr[i].type;
	for (int i = 0; i < size; ++i)//стираємо зі створеного масиву однакові записи, лишаючи лише один
	{
		for (int j = i+1; j < size; j++)
		{
			if (a[i] == a[j])
				a[j] = "";
		}
	}
	for (int i = 0; i < size; ++i)//знахомо кількість типів, що залигилися масиві
		if (a[i] != "")
			++n;
	string* a_new = new string[n];//створюємо масив, у якому будуть міститися типи товару, без повтору
	for(int i=0,j=0;i<size;++i)
		if (a[i] != "")//як тип не стертий
		{
			a_new[j] = a[i];//то присвоюємо його для щойно створеного масиву
			++j;
		}
	delete[]a;//звільємо пам'ять
	for (int i = 0; i < n; ++i)//проходимося по усіх типах товару
	{
		cout <<"\t\t\t\t"<< a_new[i] << endl;//виводимо тип 
		cout << "--------------------------------------------------------------------------------------------------------------------" << endl;
		cout << "|\tМарка товару\t|\tКількість на складі\t|\tЦіна в у.о.\t|\tЦіна в гривнях\t|" << endl;
		cout << "--------------------------------------------------------------------------------------------------------------------" << endl;
		for (int j = 0; j < size; ++j)//проходимося по масиву товарів
		{
			if (arr[j].type == a_new[i])//якщо тип товару співпадає із типом який було виведено на екран
			{
				cout << "|\t" << arr[j].mark << "\t\t";
				cout << "|\t\t" << arr[j].amount << "\t\t";//то виводимо інформацію
				cout << "|\t" << arr[j].price_us << "\t\t";
				cout << "|\t\t" << arr[j].price_ua << "\t\t|" << endl;
				cout << "Опис:\n" << arr[j].describe;
				cout << endl;
				cout << "-------------------------------------------------------------------------------------------------------------" << endl;
			}
		}
	}	
	delete[]a_new;//звільняємо пам'ять
}

int main()
{
	SetConsoleCP(1251);//зміна кодування для роботи з кирилицею
	SetConsoleOutputCP(1251);
	int k = -1;
	int size=0;//кількість записів в базі даних
	article* arr=0;//масив(база даних) для збереження інформації
	do
	{
		cout << "Курс долара:";
		cin >> us;//введення курсу долара
	} while (us <= 0);//перевірка на правильність введення даних
	
	while (k != 0)//якщо ввели нуль то завершуємо роботу
	{
		system("cls");//очищення екрану
		cout << "Виберіть один із пунктів:" << endl;//обираємо бажаний пункт, з яким хочемо працювати
		if (size==0)
			cout << "\t1-ввести дані" << endl;
		cout << "\t2-переглянути усі дані" << endl;
		cout << "\t3-додати новий запис" << endl;
		cout << "\t4-видалити запис" << endl;
		cout << "\t5-сортувати за типом товару" << endl;
		cout << "\t6-сортувати за ціною товару" << endl;
		cout << "\t7-пошук характеристики комп'ютера заданої марки" << endl;
		cout << "\t8-вивести інформацію про принтери дешевших за задану ціну" << endl;
		cout << "\t9-товари яких на складі менше 5 штук" << endl;
		cout << "\t10-корегувати ціну товарів" << endl;
		cout << "\t11-інформація, упорядкувана по типах" << endl;
		cout << "\t0-завершити роботу" << endl;
		cin >> k;
		switch (k)//відповідно до обраного пункту виконуються відповідні дії
		{
		case 1://введення даних
			if (size == 0)//ввести дані можемо лише якщо масив пустий
			{
				cout << "Кількість записів: ";
				cin >> size;//вводимо кількість записів
				arr = new article[size];//виділяємо пам'ять під масив
				enter_data(arr, size);//викликаємо функцію для введенння даних
			}
			system("pause");//затримка результатів на екрані
			break;
		case 2://вивід даних
			if (size == 0)//якщо записів немає, виводимо відповідне повідомленян
				cout << "База даних пуста."<<endl;
			else
				show_info(arr, size);//інакше виводимо всі записи з бази даних
			system("pause");
			break;
		case 3://додавання запису
		{
			article* prev = new article[size];//створюємо тимчасовий масив для збереження даних
			for (int i = 0; i < size; ++i)
				prev[i] = arr[i];//заповнюємо його елементами з головної бази даних
			++size;
			arr = new article[size];//збільшуємо розмір для головної бази даних
			for (int i = 0; i < size-1; ++i)//записуємо в головну базу даних записи що вже були раніше в ній
				arr[i] = prev[i];
			cout << "\t\tВведіть дані про товар" << endl;
			cout << "Тип товару:";
			cin >> arr[size-1].type;//і вводиом дані для нового запису
			cout << "Марка товару:";
			cin >> arr[size - 1].mark;
			cout << "Кількість на складі:";
			cin >> arr[size - 1].amount;
			cout << "Опис(характеристика):";
			cin >> arr[size - 1].describe;
			cout << "Ціна в у.о.:";
			cin >> arr[size - 1].price_us;
			arr[size - 1].price_ua = arr[size - 1].price_us * us;//переведення ціни в доларах у ціну в гривнях
			delete[]prev;//звільняємо пам'ять з тимчасового масиву
			system("pause");
			break;
		}
		case 4://видалення запису
			arr=del_note(arr, size);//виклик функції для видаленян запису
			system("pause");
			break;
		case 5://сортування за типом
			sort_by_type(arr, size);//виклик функції для сортуванян записів за типом
			cout << "Записи відсортовані за типом" << endl;
			system("pause");
			break;
		case 6://сортування за ціною
			sort_by_price(arr, size);//виклик функції для сортуванян записів за ціною
			cout << "Записи відсортовані за ціною" << endl;
			system("pause");
			break;
		case 7://пошук опису комп'ютера за заданлю маркою
		{
			string mark;
			cout << "Введіть марку для пошуку комп'ютера: ";
			cin >> mark;//введення марки
			find_discribe(arr, size, mark);//виклик функції для пошуку
			system("pause");
			break;
		}
		case 8://пошук принтерів за ціною
		{
			float price;
			cout << "Введіть ціну у гривнях для пошуку принтерів: ";
			cin >> price;//введення ціни
			find_printers(arr, size, price);//виклик функції для пошуку принтерів
			system("pause");
			break;
		}
		case 9://пошук товарів, кількість яких не перевищує 5
			find_5count(arr, size);//виклик відповідної функції
			system("pause");
			break;
		case 10://корегування ціни
			cout << "Новий курс долара: ";
			cin >> us;//введення курсу долара
			corect_price(arr, size);//виклик функції для корегування ціни
			cout << "Ціни скореговано" << endl;
			system("pause");
			break;
		case 11://вивід інформації за типами
			print_information_by_types(arr, size);//виклик відповідної інформації
			system("pause");
			break;
		}
	}
	delete[]arr;//знищуємо базу даних
	system("pause");
	return 0;
}